turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2B.atdf
        <module name="SCIF" id="I7149" version="1.3.0">
          <instance name="SCIF">
            <register-group name="SCIF" name-in-module="SCIF" address-space="base" offset="0x400E0800"/>
            <signals>
              <signal group="GCLK" index="0" function="E" pad="PA19"/>
              <signal group="GCLK" index="0" function="E" pad="PB10"/>
              <signal group="GCLK" index="0" function="A" pad="PA02"/>
              <signal group="GCLK" index="1" function="E" pad="PA20"/>
              <signal group="GCLK" index="1" function="E" pad="PB11"/>
              <signal group="GCLK" index="2" function="E" pad="PB12"/>
              <signal group="GCLK" index="3" function="E" pad="PB13"/>
              <signal group="GCLK_IN" index="0" function="E" pad="PA23"/>
              <signal group="GCLK_IN" index="0" function="E" pad="PB14"/>
              <signal group="GCLK_IN" index="1" function="E" pad="PA24"/>
              <signal group="GCLK_IN" index="1" function="E" pad="PB15"/>
              <signal group="XIN0" function="XIN0" pad="PA00"/>
              <signal group="XOUT0" function="XOUT0" pad="PA01"/>
            </signals>
            <parameters>
              <param name="BOD33_IMPLEMENTED" value="0"/>
              <param name="BOD50_IMPLEMENTED" value="0"/>
              <param name="BR_NUM" value="0"/>
              <param name="DFLL_CALIB_MSB" value="3"/>
              <param name="DFLL_COARSE_MSB" value="4"/>
              <param name="DFLL_FINE_MSB" value="7"/>
              <param name="DFLL_RANGE_MSB" value="1"/>
              <param name="GCLK_EXTCLK_MSB" value="3"/>
              <param name="GCLK_IN_MSB" value="1"/>
              <param name="GCLK_IN_NUM" value="2"/>
              <param name="GCLK_MSB" value="10"/>
              <param name="GCLK_NUM" value="12"/>
              <param name="GCLK_NUM_DFLL_REF" value="0"/>
              <param name="GCLK_NUM_DFLL_SSG" value="1"/>
              <param name="GCLK_NUM_FLO" value="4"/>
              <param name="GCLK_NUM_MASTER" value="11"/>
              <param name="GCLK_NUM_PLL" value="9"/>
              <param name="GCLK_NUM_RC32KIFB_REF" value="5"/>
              <param name="GC_USES_CLK_CPU" value="7"/>
              <param name="GC_USES_CLK_HSB" value="8"/>
              <param name="GC_USES_CLK_PBA" value="9"/>
              <param name="GC_USES_CLK_PBB" value="10"/>
              <param name="GC_USES_CLK_PBC" value="11"/>
              <param name="GC_USES_CLK_PBD" value="12"/>
              <param name="GC_USES_CLK_SLOW" value="0"/>
              <param name="GC_USES_CLK_1K" value="15"/>
              <param name="GC_USES_CLK_32" value="1"/>
              <param name="GC_USES_DFLL0" value="2"/>
              <param name="GC_USES_FLO" value="14"/>
              <param name="GC_USES_GCLKPRESC_FP" value="18"/>
              <param name="GC_USES_GCLKPRESC_HRP" value="17"/>
              <param name="GC_USES_GCLK_IN0" value="19"/>
              <param name="GC_USES_GCLK_IN1" value="20"/>
              <param name="GC_USES_MASTER" value="21"/>
              <param name="GC_USES_OSC0" value="3"/>
              <param name="GC_USES_PLL0" value="16"/>
              <param name="GC_USES_RCFAST" value="5"/>
              <param name="GC_USES_RC1M" value="6"/>
              <param name="GC_USES_RC32K" value="13"/>
              <param name="GC_USES_RC80M" value="4"/>
              <param name="OSC_NUM" value="1"/>
              <param name="PLL_NUM" value="1"/>
              <param name="RCFAST_CALIBRATION_MSB" value="6"/>
              <param name="RCFAST_FRANGE_MSB" value="1"/>
              <param name="RCOSC_FREQUENCY" value="115200"/>
              <param name="RC80M_CALIBRATION_MSB" value="1"/>
              <param name="BOD_OFF" value="0"/>
              <param name="BOD_ON" value="1"/>
              <param name="BOD_ON_NORESET" value="2"/>
              <param name="GC_DIV_CLOCK" value="1"/>
              <param name="GC_NO_DIV_CLOCK" value="0"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
        </module>
        <module name="SMAP" id="I8321" version="1.0.0">
          <instance name="SMAP">
            <register-group name="SMAP" name-in-module="SMAP" address-space="base" offset="0x400A3000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="I7602" version="2.1.1">
          <instance name="SPI">
            <register-group name="SPI" name-in-module="SPI" address-space="base" offset="0x40008000"/>
            <signals>
              <signal group="MISO" function="B" pad="PA03"/>
              <signal group="MISO" function="B" pad="PB14"/>
              <signal group="MISO" function="A" pad="PA21"/>
              <signal group="MISO" function="A" pad="PA27"/>
              <signal group="MOSI" function="B" pad="PB15"/>
              <signal group="MOSI" function="A" pad="PA22"/>
              <signal group="MOSI" function="A" pad="PA28"/>
              <signal group="NPCS" index="0" function="B" pad="PA02"/>
              <signal group="NPCS" index="0" function="A" pad="PA24"/>
              <signal group="NPCS" index="0" function="A" pad="PA30"/>
              <signal group="NPCS" index="1" function="C" pad="PA13"/>
              <signal group="NPCS" index="1" function="B" pad="PB13"/>
              <signal group="NPCS" index="1" function="A" pad="PA31"/>
              <signal group="NPCS" index="2" function="C" pad="PA14"/>
              <signal group="NPCS" index="2" function="B" pad="PB11"/>
              <signal group="NPCS" index="3" function="C" pad="PA15"/>
              <signal group="NPCS" index="3" function="B" pad="PB12"/>
              <signal group="SCK" function="A" pad="PA23"/>
              <signal group="SCK" function="A" pad="PA29"/>
            </signals>
            <parameters>
              <param name="CS_MSB" value="3"/>
              <param name="PDCA_ID_RX" value="4"/>
              <param name="PDCA_ID_TX" value="22"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="I7604" version="4.0.2">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40010000"/>
            <signals>
              <signal group="A0" function="D" pad="PB07"/>
              <signal group="A0" function="B" pad="PA08"/>
              <signal group="A1" function="D" pad="PB09"/>
              <signal group="A1" function="B" pad="PA10"/>
              <signal group="A2" function="D" pad="PB11"/>
              <signal group="A2" function="B" pad="PA12"/>
              <signal group="B0" function="D" pad="PB08"/>
              <signal group="B0" function="B" pad="PA09"/>
              <signal group="B1" function="D" pad="PB10"/>
              <signal group="B1" function="B" pad="PA11"/>
              <signal group="B2" function="D" pad="PB12"/>
              <signal group="B2" function="B" pad="PA13"/>
              <signal group="CLK0" function="D" pad="PB13"/>
              <signal group="CLK0" function="B" pad="PA14"/>
              <signal group="CLK1" function="D" pad="PB14"/>
              <signal group="CLK1" function="B" pad="PA15"/>
              <signal group="CLK2" function="D" pad="PB15"/>
              <signal group="CLK2" function="B" pad="PA16"/>
            </signals>
            <parameters>
              <param name="CLK_DIV1" value="gen_clk_tc0"/>
              <param name="CLK_DIV2" value="2"/>
              <param name="CLK_DIV3" value="8"/>
              <param name="CLK_DIV4" value="32"/>
              <param name="CLK_DIV5" value="128"/>
              <param name="GCLK_NUM" value="5"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40014000"/>
            <signals>
            </signals>
            <parameters>
              <param name="CLK_DIV1" value="gen_clk_tc1"/>
              <param name="CLK_DIV2" value="2"/>
              <param name="CLK_DIV3" value="8"/>
              <param name="CLK_DIV4" value="32"/>
              <param name="CLK_DIV5" value="128"/>
              <param name="GCLK_NUM" value="8"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
