turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2B.atdf
        <register name="FSR" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Flash Controller Status Register">
          <bitfield name="FRDY" caption="Flash Ready Status" mask="0x1"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x4"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x8"/>
          <bitfield name="SECURITY" caption="Security Bit Status" mask="0x10"/>
          <bitfield name="QPRR" caption="Quick Page Read Result" mask="0x20"/>
          <bitfield name="HSMODE" caption="High Speed Mode" mask="0x40"/>
          <bitfield name="ECCERR" caption="ECC Error Status" mask="0x300" values="FLASHCALW_FSR__ECCERR"/>
          <bitfield name="LOCK0" caption="Lock Region 0 Lock Status" mask="0x10000"/>
          <bitfield name="LOCK1" caption="Lock Region 1 Lock Status" mask="0x20000"/>
          <bitfield name="LOCK2" caption="Lock Region 2 Lock Status" mask="0x40000"/>
          <bitfield name="LOCK3" caption="Lock Region 3 Lock Status" mask="0x80000"/>
          <bitfield name="LOCK4" caption="Lock Region 4 Lock Status" mask="0x100000"/>
          <bitfield name="LOCK5" caption="Lock Region 5 Lock Status" mask="0x200000"/>
          <bitfield name="LOCK6" caption="Lock Region 6 Lock Status" mask="0x400000"/>
          <bitfield name="LOCK7" caption="Lock Region 7 Lock Status" mask="0x800000"/>
          <bitfield name="LOCK8" caption="Lock Region 8 Lock Status" mask="0x1000000"/>
          <bitfield name="LOCK9" caption="Lock Region 9 Lock Status" mask="0x2000000"/>
          <bitfield name="LOCK10" caption="Lock Region 10 Lock Status" mask="0x4000000"/>
          <bitfield name="LOCK11" caption="Lock Region 11 Lock Status" mask="0x8000000"/>
          <bitfield name="LOCK12" caption="Lock Region 12 Lock Status" mask="0x10000000"/>
          <bitfield name="LOCK13" caption="Lock Region 13 Lock Status" mask="0x20000000"/>
          <bitfield name="LOCK14" caption="Lock Region 14 Lock Status" mask="0x40000000"/>
          <bitfield name="LOCK15" caption="Lock Region 15 Lock Status" mask="0x80000000"/>
        </register>
        <register name="FPR" offset="0xC" rw="R" size="4" access-size="4" caption="Flash Controller Parameter Register">
          <bitfield name="FSZ" caption="Flash Size" mask="0xF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x700"/>
        </register>
        <register name="VERSION" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000110" caption="Flash Controller Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="FGPFRHI" offset="0x14" rw="RW" size="4" access-size="4" caption="Flash Controller General Purpose Fuse Register High">
          <bitfield name="GPF32" caption="General Purpose Fuse 32" mask="0x1"/>
          <bitfield name="GPF33" caption="General Purpose Fuse 33" mask="0x2"/>
          <bitfield name="GPF34" caption="General Purpose Fuse 34" mask="0x4"/>
          <bitfield name="GPF35" caption="General Purpose Fuse 35" mask="0x8"/>
          <bitfield name="GPF36" caption="General Purpose Fuse 36" mask="0x10"/>
          <bitfield name="GPF37" caption="General Purpose Fuse 37" mask="0x20"/>
          <bitfield name="GPF38" caption="General Purpose Fuse 38" mask="0x40"/>
          <bitfield name="GPF39" caption="General Purpose Fuse 39" mask="0x80"/>
          <bitfield name="GPF40" caption="General Purpose Fuse 40" mask="0x100"/>
          <bitfield name="GPF41" caption="General Purpose Fuse 41" mask="0x200"/>
          <bitfield name="GPF42" caption="General Purpose Fuse 42" mask="0x400"/>
          <bitfield name="GPF43" caption="General Purpose Fuse 43" mask="0x800"/>
          <bitfield name="GPF44" caption="General Purpose Fuse 44" mask="0x1000"/>
          <bitfield name="GPF45" caption="General Purpose Fuse 45" mask="0x2000"/>
          <bitfield name="GPF46" caption="General Purpose Fuse 46" mask="0x4000"/>
          <bitfield name="GPF47" caption="General Purpose Fuse 47" mask="0x8000"/>
          <bitfield name="GPF48" caption="General Purpose Fuse 48" mask="0x10000"/>
          <bitfield name="GPF49" caption="General Purpose Fuse 49" mask="0x20000"/>
          <bitfield name="GPF50" caption="General Purpose Fuse 50" mask="0x40000"/>
          <bitfield name="GPF51" caption="General Purpose Fuse 51" mask="0x80000"/>
          <bitfield name="GPF52" caption="General Purpose Fuse 52" mask="0x100000"/>
          <bitfield name="GPF53" caption="General Purpose Fuse 53" mask="0x200000"/>
          <bitfield name="GPF54" caption="General Purpose Fuse 54" mask="0x400000"/>
          <bitfield name="GPF55" caption="General Purpose Fuse 55" mask="0x800000"/>
          <bitfield name="GPF56" caption="General Purpose Fuse 56" mask="0x1000000"/>
          <bitfield name="GPF57" caption="General Purpose Fuse 57" mask="0x2000000"/>
          <bitfield name="GPF58" caption="General Purpose Fuse 58" mask="0x4000000"/>
          <bitfield name="GPF59" caption="General Purpose Fuse 59" mask="0x8000000"/>
          <bitfield name="GPF60" caption="General Purpose Fuse 60" mask="0x10000000"/>
          <bitfield name="GPF61" caption="General Purpose Fuse 61" mask="0x20000000"/>
          <bitfield name="GPF62" caption="General Purpose Fuse 62" mask="0x40000000"/>
          <bitfield name="GPF63" caption="General Purpose Fuse 63" mask="0x80000000"/>
        </register>
        <register name="FGPFRLO" offset="0x18" rw="RW" size="4" access-size="4" caption="Flash Controller General Purpose Fuse Register Low">
          <bitfield name="LOCK0" caption="Lock Bit 0" mask="0x1"/>
          <bitfield name="LOCK1" caption="Lock Bit 1" mask="0x2"/>
          <bitfield name="LOCK2" caption="Lock Bit 2" mask="0x4"/>
          <bitfield name="LOCK3" caption="Lock Bit 3" mask="0x8"/>
          <bitfield name="LOCK4" caption="Lock Bit 4" mask="0x10"/>
          <bitfield name="LOCK5" caption="Lock Bit 5" mask="0x20"/>
          <bitfield name="LOCK6" caption="Lock Bit 6" mask="0x40"/>
          <bitfield name="LOCK7" caption="Lock Bit 7" mask="0x80"/>
          <bitfield name="LOCK8" caption="Lock Bit 8" mask="0x100"/>
          <bitfield name="LOCK9" caption="Lock Bit 9" mask="0x200"/>
          <bitfield name="LOCK10" caption="Lock Bit 10" mask="0x400"/>
          <bitfield name="LOCK11" caption="Lock Bit 11" mask="0x800"/>
          <bitfield name="LOCK12" caption="Lock Bit 12" mask="0x1000"/>
          <bitfield name="LOCK13" caption="Lock Bit 13" mask="0x2000"/>
          <bitfield name="LOCK14" caption="Lock Bit 14" mask="0x4000"/>
          <bitfield name="LOCK15" caption="Lock Bit 15" mask="0x8000"/>
          <bitfield name="GPF16" caption="General Purpose Fuse 16" mask="0x10000"/>
          <bitfield name="GPF17" caption="General Purpose Fuse 17" mask="0x20000"/>
          <bitfield name="GPF18" caption="General Purpose Fuse 18" mask="0x40000"/>
          <bitfield name="GPF19" caption="General Purpose Fuse 19" mask="0x80000"/>
          <bitfield name="GPF20" caption="General Purpose Fuse 20" mask="0x100000"/>
          <bitfield name="GPF21" caption="General Purpose Fuse 21" mask="0x200000"/>
          <bitfield name="GPF22" caption="General Purpose Fuse 22" mask="0x400000"/>
          <bitfield name="GPF23" caption="General Purpose Fuse 23" mask="0x800000"/>
          <bitfield name="GPF24" caption="General Purpose Fuse 24" mask="0x1000000"/>
          <bitfield name="GPF25" caption="General Purpose Fuse 25" mask="0x2000000"/>
          <bitfield name="GPF26" caption="General Purpose Fuse 26" mask="0x4000000"/>
          <bitfield name="GPF27" caption="General Purpose Fuse 27" mask="0x8000000"/>
          <bitfield name="GPF28" caption="General Purpose Fuse 28" mask="0x10000000"/>
          <bitfield name="GPF29" caption="General Purpose Fuse 29" mask="0x20000000"/>
          <bitfield name="GPF30" caption="General Purpose Fuse 30" mask="0x40000000"/>
          <bitfield name="GPF31" caption="General Purpose Fuse 31" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="FLASHCALW_FCR__FRDY">
        <value name="0" caption="Flash Ready does not generate an interrupt" value="0"/>
        <value name="1" caption="Flash Ready generates an interrupt" value="1"/>
      </value-group>
