turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2B.atdf
        <register name="IFRC" offset="0xD8" rw="W" size="4" access-size="4" atomic-op="clear:IFR" caption="Interrupt Flag Register - Clear">
          <bitfield name="P0" caption="Interrupt Flag" mask="0x1"/>
          <bitfield name="P1" caption="Interrupt Flag" mask="0x2"/>
          <bitfield name="P2" caption="Interrupt Flag" mask="0x4"/>
          <bitfield name="P3" caption="Interrupt Flag" mask="0x8"/>
          <bitfield name="P4" caption="Interrupt Flag" mask="0x10"/>
          <bitfield name="P5" caption="Interrupt Flag" mask="0x20"/>
          <bitfield name="P6" caption="Interrupt Flag" mask="0x40"/>
          <bitfield name="P7" caption="Interrupt Flag" mask="0x80"/>
          <bitfield name="P8" caption="Interrupt Flag" mask="0x100"/>
          <bitfield name="P9" caption="Interrupt Flag" mask="0x200"/>
          <bitfield name="P10" caption="Interrupt Flag" mask="0x400"/>
          <bitfield name="P11" caption="Interrupt Flag" mask="0x800"/>
          <bitfield name="P12" caption="Interrupt Flag" mask="0x1000"/>
          <bitfield name="P13" caption="Interrupt Flag" mask="0x2000"/>
          <bitfield name="P14" caption="Interrupt Flag" mask="0x4000"/>
          <bitfield name="P15" caption="Interrupt Flag" mask="0x8000"/>
          <bitfield name="P16" caption="Interrupt Flag" mask="0x10000"/>
          <bitfield name="P17" caption="Interrupt Flag" mask="0x20000"/>
          <bitfield name="P18" caption="Interrupt Flag" mask="0x40000"/>
          <bitfield name="P19" caption="Interrupt Flag" mask="0x80000"/>
          <bitfield name="P20" caption="Interrupt Flag" mask="0x100000"/>
          <bitfield name="P21" caption="Interrupt Flag" mask="0x200000"/>
          <bitfield name="P22" caption="Interrupt Flag" mask="0x400000"/>
          <bitfield name="P23" caption="Interrupt Flag" mask="0x800000"/>
          <bitfield name="P24" caption="Interrupt Flag" mask="0x1000000"/>
          <bitfield name="P25" caption="Interrupt Flag" mask="0x2000000"/>
          <bitfield name="P26" caption="Interrupt Flag" mask="0x4000000"/>
          <bitfield name="P27" caption="Interrupt Flag" mask="0x8000000"/>
          <bitfield name="P28" caption="Interrupt Flag" mask="0x10000000"/>
          <bitfield name="P29" caption="Interrupt Flag" mask="0x20000000"/>
          <bitfield name="P30" caption="Interrupt Flag" mask="0x40000000"/>
          <bitfield name="P31" caption="Interrupt Flag" mask="0x80000000"/>
        </register>
        <register name="ODMER" offset="0xE0" rw="RW" size="4" access-size="4" caption="Open Drain Mode Register">
          <bitfield name="P0" caption="Open Drain Mode Enable" mask="0x1"/>
          <bitfield name="P1" caption="Open Drain Mode Enable" mask="0x2"/>
          <bitfield name="P2" caption="Open Drain Mode Enable" mask="0x4"/>
          <bitfield name="P3" caption="Open Drain Mode Enable" mask="0x8"/>
          <bitfield name="P4" caption="Open Drain Mode Enable" mask="0x10"/>
          <bitfield name="P5" caption="Open Drain Mode Enable" mask="0x20"/>
          <bitfield name="P6" caption="Open Drain Mode Enable" mask="0x40"/>
          <bitfield name="P7" caption="Open Drain Mode Enable" mask="0x80"/>
          <bitfield name="P8" caption="Open Drain Mode Enable" mask="0x100"/>
          <bitfield name="P9" caption="Open Drain Mode Enable" mask="0x200"/>
          <bitfield name="P10" caption="Open Drain Mode Enable" mask="0x400"/>
          <bitfield name="P11" caption="Open Drain Mode Enable" mask="0x800"/>
          <bitfield name="P12" caption="Open Drain Mode Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Open Drain Mode Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Open Drain Mode Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Open Drain Mode Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Open Drain Mode Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Open Drain Mode Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Open Drain Mode Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Open Drain Mode Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Open Drain Mode Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Open Drain Mode Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Open Drain Mode Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Open Drain Mode Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Open Drain Mode Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Open Drain Mode Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Open Drain Mode Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Open Drain Mode Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Open Drain Mode Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Open Drain Mode Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Open Drain Mode Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Open Drain Mode Enable" mask="0x80000000"/>
        </register>
        <register name="ODMERS" offset="0xE4" rw="W" size="4" access-size="4" atomic-op="set:ODMER" caption="Open Drain Mode Register - Set">
          <bitfield name="P0" caption="Open Drain Mode Enable" mask="0x1"/>
          <bitfield name="P1" caption="Open Drain Mode Enable" mask="0x2"/>
          <bitfield name="P2" caption="Open Drain Mode Enable" mask="0x4"/>
          <bitfield name="P3" caption="Open Drain Mode Enable" mask="0x8"/>
          <bitfield name="P4" caption="Open Drain Mode Enable" mask="0x10"/>
          <bitfield name="P5" caption="Open Drain Mode Enable" mask="0x20"/>
          <bitfield name="P6" caption="Open Drain Mode Enable" mask="0x40"/>
          <bitfield name="P7" caption="Open Drain Mode Enable" mask="0x80"/>
          <bitfield name="P8" caption="Open Drain Mode Enable" mask="0x100"/>
          <bitfield name="P9" caption="Open Drain Mode Enable" mask="0x200"/>
          <bitfield name="P10" caption="Open Drain Mode Enable" mask="0x400"/>
          <bitfield name="P11" caption="Open Drain Mode Enable" mask="0x800"/>
          <bitfield name="P12" caption="Open Drain Mode Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Open Drain Mode Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Open Drain Mode Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Open Drain Mode Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Open Drain Mode Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Open Drain Mode Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Open Drain Mode Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Open Drain Mode Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Open Drain Mode Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Open Drain Mode Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Open Drain Mode Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Open Drain Mode Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Open Drain Mode Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Open Drain Mode Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Open Drain Mode Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Open Drain Mode Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Open Drain Mode Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Open Drain Mode Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Open Drain Mode Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Open Drain Mode Enable" mask="0x80000000"/>
        </register>
